var Traits = {"星座特質" : {"摩羯座" : "摩羯座 Capricorn ♑\n日期:12/22 ~ 1/19\n摩羯座是非常自律,而且做事縝密周全的代表。絕對是謹慎、可靠、有責任感的人,他們對自己也有相當的抱負。因為很難真的了解他們的內心想法,容易給人一種距離感。" , "水瓶座" : "水瓶座 Aquarius ♒\n日期:1/20 ~ 2/18\n水瓶座是公認的外星星座,個性古怪,經常陷入自己的小世界。他們的求知欲強、興趣廣泛,樂於嘗試不同的新事物,而且富有創造力和冒險精神。亦有人認為水瓶座的性格叛逆、不合群,容易心不在焉。" , "雙魚座" : "雙魚座 Pisces ♓\n日期:2/19 ~ 3/20\n雙魚座充滿情感,富有同情心又善解人意,絕對是一個標準的浪漫主義者。他們天性溫柔無私,善於察言觀色。但是過於感性和單純的想法行事,反而讓人有種不切實際、軟弱和、逃避現實的印象。" , "牡羊座" : "牡羊座 Aries ♈\n日期:3/21 ~ 4/19\n牧羊座天生大方、開朗、友善。他們的行事風格自由,不喜歡被束縛,而且富冒險精神。但是有時候會因為太急躁和不願接受批評而會弄巧成拙。適時應放慢腳步,多點耐心～" , "金牛座" : "金牛座 Taurus ♉\n日期:4/20 ~ 5/20\n金牛座個性勤勞、務實、穩重,且溫和順從,他們不管別人閒事,是高明的社交高手。他們很有主見、有耐心及責任感,但就是出了名的固執和過於理性,偶爾給人過於冷淡的印象。" , "雙子座" : "雙子座 Gemini ♊\n日期:5/21 ~ 6/21\n雙子座有著敏銳的觀察力,豐富的靈感和想像力。他們活潑健談,善於隨機應變與說服他人,同時亦是很好的傾聽者。不過雙子座也很善變、沒有耐心和過分猜忌,容易與人產生誤會和摩擦。" , "巨蟹座" : "巨蟹座 Cancer ♋\n日期:6/22 ~ 7/22\n巨蟹座絕對是最愛家的代表星座！他們會用心對待自己的另一半和家人朋友,既重情義又富有包容心。可是當他們太在意別人情緒的時候經常會犧牲自己的感受,過份的多愁善感容易給人一種喜怒無常的印象。" , "獅子座" : "獅子座 Leo ♌\n日期:7/23 ~ 8/22\n獅子座的人總是喜歡展現自己,他們富有同情心和幽默感,為人熱心,亦會努力實現自己的目標。不過,他們有時候主觀意識太強,要避免自視過高。" , "處女座" : "處女座 Virgo ♍\n日期:8/23 ~ 9/22\n處女座給大眾的印象都是龜毛、完美主義、難以取悅,但其實這他們是注重細節的表現。他們頭腦清晰、分析能力強,但有時過於追求完美,反而會讓自己及身邊的人壓力太大。" , "天秤座" : "天秤座 Libra ♎\n日期:9/23 ~ 10/23\n天秤座是標準的和平使者,不喜歡矛盾和糾紛。他們的天性善解人意、容易相處、善於交際,同時是個看重浪漫的氛圍的理想主義者。而最受詬病的是性格優柔寡斷,容易隨波逐流,對事情沒有太多的意見。" , "天蠍座" : "天蠍座 Scorpio ♏\n日期:10/24 ~ 11/22\n天蠍座是一個心思細膩且敏感的星座。大眾一般形容天蠍座的佔有欲、妒心與報復心都很強,這是因為他們對待感情的態度非常認真,也因此而敢愛敢恨。他們有時容易感情用事,切忌心機太重！" , "射手座" : "射手座 Sagittarius ♐\n日期:11/23 ~ 12/21\n射手座的人為人坦誠、適應力強、熱愛自由、同時正義感極強。他們處事圓滑,有良好的判斷力,亦善於危機處。可以要注意性格敏感或過於浮躁,使得言語間得罪他人！"} , 
          "四象星座特質" : {"水象星座" : "您的四象星座是「水象星座⮕ 代表情緒」\n水象星座很容易被情緒和慾望所驅使,也因此生性比較細膩敏感,比較重感情。豐感情和善解人意的水象星座是很好的傾聽者,但偶爾也會陷入突如其來的憂鬱或擔憂情緒。" , "火象星座" : "您的四象星座是「火象星座⮕ 代表能量」\n火象星座總是給人一種熱情、活力、自信的感覺。他們自我意識強,喜歡表演,喜歡成為聚光燈下的焦點。因此他們非常熱衷於當領導者。而火象星座的自尊心和競爭力很強,所以不喜歡失去的感覺,也不易聽取別人的意見。" , "風象星座" : "您的四象星座是「風象星座⮕ 代表頭腦」\n風象星座是多變、不受拘束的。他們喜歡自由創作,擅長抽象語言思維、邏輯推理、理性分析和溝通表達。不過和風象星座溝通要有邏輯且簡單明瞭,因為一旦他們失去興致,便會直接過濾掉你說的一切～" , "土象星座" : "您的四象星座是「土象星座⮕ 代表身體」\n土象星座是穩紮穩打的代表,他們凡事都會先計畫周全再去執行,而且執行力非常高,一旦下定決心就會貫徹始終。腳踏實地的土象星座行事風格偏保守務實,善於對每件事做利弊分析,但有時亦會被認為過於固執己見"} , 
          "生命靈數特質" : {1 : "生命靈數「1號」,也叫做「創始數」\n1號人在執行任務的過程中,通常喜歡並需要規劃或是建立一套屬於自己的方式、自己的領域、自己的圈子他們在乎的不是大小、人數,他們在乎的是如何在團體中樹立起個人標準,讓身邊的人感到佩服並願意跟隨。" , 2 : "生命靈數「2號」,也叫做「平衡數」\n2號人很享受調解雙邊矛盾和衝突的過程,他們擁有以柔克剛的能力,擅長以一個平衡者的角色來幫助團體達到集體成功的目標,並將資源做到公平的最佳分配,希望讓大家都能對結果感到滿意並感謝2號人的協調與努力。" , 3 : "生命靈數「3號」,也叫做「表達數」\n3號人具有旺盛的好奇心,樂觀且善於溝通,具有孩子般的童心和多變性。他們有著天馬行空的想像力,以及突破現況的超強能力,能持續輸出超級與眾不同的好點子和創新的契機點,讓3號人感覺到幸福和存在的價值。" , 4 : "生命靈數「4號」,也叫做「執行數」\n4號人的強項就是實現和做出來,實際執行的同時也非常謹慎、講求規矩,並努力遠離風險。面對風險較高的事物時,會花時間評估成功的機率以及需要付出的代價,因為4號人希望自己的每一步都往正確的方向前進,才能幫自己累積更多的資源和財富。" , 5 : "生命靈數「5號」,也叫做「自由數」\n5號人擁有自由的靈魂,致力於追求身心自由、不受約束,希望能隨心所欲掌管自己的人生和隨時擁有自己想要的空間。當他們面對壓力和第一次嘗試的事物時,較能帶著冒險精神及隨遇而安的特質來解決任務,因為5號人深信,只要自己願意就沒有做不到的事情。" , 6 : "生命靈數「6號」,也叫做「奉獻數」\n6號人重視親情,對親情、友情以及愛情的需求非常強烈和渴望,這讓他們願意主動先讓對方感受到自己的誠意和愛意,希望經由這般主動且溫暖的相處過程,讓自己順利走進婚姻生活。家庭美滿和持續接收到滿滿的愛,就是6號人重要的人生目標之一。" , 7 : "生命靈數「7號」,也叫做「幸運數」\n7號人被視為與神有著神祕連結的象徵,如同西方人常說的「Lucky7」,他們的內心會一直找尋與他人在精神方面的深度連結,以及探詢事情的深度意義。他們的直覺性非常高,也因為這樣天生的絕對感受能力,讓7號人本質中住著一個嚴格的靈魂,對萬物的標準非常高,往往需要看到事實證據才會選擇相信。" , 8 : "生命靈數「8號」,也叫做「因果數」\n8號人在乎的是在生活或職場中,是否擁有統治、控制的權力,同時也非常看重個人成就的展現與財富的累積。因果數的特質,讓他們的本質上非常重視效率、執行力,並願意身體力行。他們不愛空想,那會讓他們覺得不夠實際,他們更看重的是掌握在自己手中的東西,盡量不做自己沒有把握的事情。" , 9 : "生命靈數「9號」,也叫做「大愛數」\n9號人希望世界和平,並期待全人類都可以過著幸福美滿的生活。他們追求心靈層面的提升,因為他們對於精神層面有著很高的期待和要求,希望自己給人的正面感受是熱心公益、心懷慈悲,願意在能力範圍之內照顧所有需要幫助的人。"} , 
          "上升星座特質" : {"獅子座" : "您的上升星座是「獅子座」,特質:愛領導、富幽默感,他們有明朗、開放且充滿自信的態度,不論走到哪裡,都會給人一種華麗的印象。自己則喜歡領導別人,總希望引人注意。講話時動作有點誇張,充滿幽默感,社交能力頗佳。" , "處女座" : "您的上升星座是「處女座」,特質:心思細膩、認真、有潔癖,他們心思非常細膩,而且愛好乾淨,對自己的工作和義務很忠實,幾近於神經質。認真而有潔癖。嚴守約定的你,會受到人們相當的信賴。每天都過得很零碎匆忙,且越零碎匆忙越在混亂中感到充實,閒下來才會發慌,潛意識中會害怕自己是無用的人。個性勤奮﹑活潑,人緣超好,有過動傾向。" , "天秤座" : "您的上升星座是「天秤座」,特質:富有情調、內心空虛,他們是最文雅且最具有情調的上升星座,追求優雅氣息的上升天秤,往往因為不想失去從容而寧可戴上面具配合環境,不做多餘掙扎,掩蓋真正的情緒與慾望,好讓自己看來永遠平衡。也許外表上成功地做到了,內心卻有可能很空虛。" , "天蠍座" : "您的上升星座是「天蠍座」,特質:隱藏真心、行事低調,他們給人的印象是像個謎團,而將真心隱藏於深處。由於他們的面具很厚又牢固,將你真正的表情掩蓋住,所以不善於表達你真正的心情。上升天蠍是真正有神秘感的人,他們行事頗為低調隱密,不喜歡談論私事,喜歡「暗中自己解決」所有事,並有想消失就隨時隱形的能力,成功地隱沒在人群之中。無人真正了解他,連他自己都未必很了解內在的爆發力有多少,一切端視遇到事件而定,尤其遇到生死交關的大事,他才發現自己其實非常強韌、好勝、絕不服輸,此時的他魄力十足,是低調但無法忽視的存在。" , "射手座" : "您的上升星座是「射手座」,特質:追求自由、理想主義者他們的行動力、好奇心都很旺盛,一刻也停不下來,喜好追求自由,憧憬遠方的事物。給人的印象是快活、開放、運動型,不過一旦你受到這個面具的支配,就會成為整天夢想著遙遠世界的理想主義者。他們有迅速解析他人心思的能力,他們隨時都在吸收外界訊息,就像高倍數的軟體,意念一竄入便令他直接做出反應「沒想太多」。" , "摩羯座" : "您的上升星座是「摩羯座」,特質:冷靜果斷、現實勢利,他們給人的印象決不是闊氣或有顯著的才能,但卻具有冷靜的判斷力及堅忍不拔的特性。年輕時雖不見得是如此,但隨著年齡的增長,敦厚高尚的品格就會顯現出來。你的面具生活在社會上極其方便,但必須注意不要被面具所束縛,而遺忘了你多年的夢想。雖然不喜歡求人照顧自己,但強烈想被尊重的心會使他們力爭上游爭取更上一層樓的機會而在所不惜,在別人眼裡不免顯得現實勢利。" , "水瓶座" : "您的上升星座是「水瓶座」,特質:勇於做自己、不畏人言他們非常有個性而且智慧高,給人的印象是獨特、有點古怪、不太會感情用事、看起來很冷漠,不想和別人一樣,因此往往會熱衷於古怪的思想和作風,或被新奇事物強烈的吸引,水瓶希望自己對世界有所貢獻,為人類謀福祉,擁有無私的大愛精神,你們的直覺敏銳、具有創造的天分,所以有時也給人藝術家的感覺。上升星座水瓶的人喜歡和朋友一起旅行,不論長期短期,出國或在國內,都可以帶給你們精神上充沛的活力。" , "雙魚座" : "您的上升星座是「雙魚座」,特質:愛幻想、短期工作能力驚人他們具有非常纖細和優異的感受性,喜歡做夢的你會引發周圍的人產生保護的本能,想要來保護你。而你也非常親切,看到別人蒙受痛苦時,總是無法釋懷。他們具備很強的工作能力,但卻會儘可能地「粉飾」所謂的忙碌,好讓自己不要因此而產生想逃或想躲的念頭。他們的注意力集中時效果驚人,但放鬆後又回到「彈性疲乏狀態」,鬆到甚麼都忘光光、甚麼都迷迷糊糊的也不一定。所以最佳工作模式便是一陣鬆一陣緊,既不能一直鬆,也不能一直緊,就像浪潮一般,高潮過後需要退潮,退潮之後自然會去尋找下一波高潮,永遠不需要擔心他的人生平靜無波。" , "牡羊座" : "您的上升星座是「牡羊座」,特質:熱情獨立、快速有效率他們給人的印象是非常活躍且爽快,行動敏捷、發言明確,凡事當自己認為正確無誤的話,勢必貫徹到底。給他人的印象是非常熱情,生氣勃勃,使內心有點不安,也會突破難關的。上升白羊不是展現在個性上,而是行動非常獨立,也許很適合個人作業方式,因為他喜歡快速﹑效率,也較不受人控制,對事情的衝刺熱頭過了就會緩慢下來,另尋新的目標,所以對新的事業或執行方式會更有熱力。" , "金牛座" : "您的上升星座是「金牛座」,特質:從容不迫、穩健踏實他們給人的印象是淡泊寧靜且穩重優雅,對所有事都從容不迫,穩健而踏實。你所喜歡的是自然的節奏,而不願凡事都顯得忙忙碌碌。你一旦著手做一件事,就不是那麼容易罷手。生活習慣固定了就不喜更改,不愛搬家,行為不燥動,居家一但穩定下來就會心安,對居所不會要求太多,有得住就好。" , "雙子座" : "您的上升星座是「雙子座」,特質:頭腦靈活、善於交際他們的頭腦動得很快,能迅速的察覺對方的想法和心情,反應也不錯。你擁有善於交際,能看出潮流走向的一個面具。因此有被周圍狀況所左右,喪失初衷之虞。喜歡嘗試新事物,有三分鐘熱度傾向,無法專注某件事太久,會想改變以增添生活情趣,不論是外表﹑還是搬家﹑佈置﹑工作等,具有夢幻特質與理想性。" , "巨蟹座" : "您的上升星座是「巨蟹座」,特質:親切勤奮、極具親和力他們給人的印象是有點怕生的傾向,但很容易親近,是非常親切而勤奮的人。言行舉止常受情緒的影響,但也惹人喜愛。同類意識非常強,在團體中常想庇護弱者。一旦感情遭到傷害,可能要拖很久才能撫平傷痛。追求平淡平凡,公私分明,不喜歡生活節奏受干擾。有親和力,擅長教育,保護弱小。"} , 
          "下降星座特質" : {"水瓶座" : "您的下降星座是「水瓶座」,特質:強烈的行事作風,容易吸引到一些厲害的人你的辦事能力很好,有大將之風,是個很機靈的人,強烈的行事作風總是會吸引到眾人的目光,很多人對你另眼相看,認為你是個很有才情的人。但你有時候會有點目中無人,於是當有人懷疑你的做事能力時,你就會非常的不屑一顧,同時也不喜歡自己的事情被干涉,但如果是給予你好的意見或點子,你也會欣然接受,且熱情相待～" , "雙魚座" : "您的下降星座是「雙魚座」,特質:做事很有能力,但往往會害到自己,你的行事作風十分果斷,做事效率極佳,今天的事絕對不拖到明天,是大家眼裡的好模範。同時在人際關係裡總是習慣付出很多,甚至還會把別人的事情當作自己的責任,人們也會漸漸習慣你對他們的好,認為你做這麼多事情是理所應當的,所以建議停下來好好思考,到底該不該這樣繼續下去,試著想想自己是不是真的要付出這麼多呢？" , "牡羊座" : "您的下降星座是「牡羊座」,特質:個性太善良導致淪為爛好人,你的性格溫順、善良～很容易同情別人,但這也是導致你經常淪為爛好人的情況,雖然你的表面上總是一副漠不關心、事不關已的樣子,但其實你已經陷入了緊張不已的情緒,你可能會有點手足無措,因為你是不喜歡招惹麻煩的人,但又想不出好的對策,所以平時可能要多多注意人際關係這一塊,盡量不要讓自己陷入不必要的麻煩喔！" , "金牛座" : "您的下降星座是「金牛座」,特質:思考周全、規劃完善,但經常內心糾結,你的思緒清晰,任何事情都會再三思考再去執行,對生活也是相當有規劃的,能說是任何事情都在你的掌控之中～不過你也是一個想很多的人,經常想到一些人不會注意到的事情,雖然這是好事但同時也是壞事,很容易變成想太多而陷入迷惘,有時會懷疑自己,但其實你已經做的很多了,建議可以放慢腳步和內心緊張的氛圍,有時候敞開心胸,讓自己輕鬆一些" , "雙子座" : "您的下降星座是「雙子座」,特質:樂觀自由、個性隨和的靈魂你的內在是一個充滿自由富有理想的人,雖然有理想是好事,但做事情時常卻只有三分鐘熱度,不過你隨和的個性經常能夠吸引到一群朋友,你為人樂觀、做事坦蕩,這樣的性格讓所有人都覺得你很好相處～是人群中的開心果。但說話有時會不經思考,容易在自己沒驚覺的狀態下得罪到人,所以還是要謹慎一點,避免說錯話無法挽回喔！" , "巨蟹座" : "您的下降星座是「巨蟹座」,特質:是眾人眼裡可靠的對象你是一個習慣把所有責任往身上攬的人,因為你對自己要求很高,想把每件事情做到好,同時你也是眾人眼裡很可靠的對象。但你或許總認為把所有事情放在內心就是成熟的表現,其實不然,這樣子到最後的結果往往會把自己搞得遍體鱗傷,建議可以嘗試著放手一搏,讓自己眼界放遠,同時內心也能開闊一些,猶豫不定的事情也會變得明朗的～" , "獅子座" : "您的下降星座是「獅子座」,特質:看似溫和的外表下,隱藏著倔強的脾氣雖然你表面上看起來總是溫溫和和的,也不善表達,總是對人露出一副你不在意的樣子,但其實你的脾氣是倔強到不行,遇到事情你不可能輕易放棄,所以一直處於鬥爭中,雖然懂得堅持是好的,但如果過於頑強不肯放下,那就比較沒必要了,建議不需要跟別人處在硬碰硬的狀態,遇到問題時,如果懂得適時圓滑處理～那會讓事情更加圓滿的喔！" , "處女座" : "您的下降星座是「處女座」,特質:擁有很多鬼點子、想法浪漫,但有時會忘記現實你的內心柔軟,想法有時候偏感性,對於很多事情總是充滿了無限的想像～但如果只是光想而不去執行的話,那些美好的幻想終究還是一場空,建議還是要學著打破一些天馬行空的想法,務實一點,先面對現實生活的問題,好好去處理手邊的工作和該完成的事項喔！" , "天秤座" : "您的下降星座是「天秤座」,特質:能力佳,總是掌握主導權在人群中,你總是很能夠第一眼就被看見,因為你是一貫掌握主導權的那個人～你也很能夠適應這樣的環境,所以往往身邊的人都是會從旁協助你的,你可能會發現身邊的人都是願意順從你意見的人,但是等過了一段時間,或許這樣的關係不會一直持續下去,可能你身旁的人也會漸漸的懷疑自己的能力而離你而去,這樣的確是比較可惜的～你也會因此而覺得有點難過" , "天蠍座" : "您的下降星座是「天蠍座」,特質:保守且重情,外表看起來強勢但其實心很軟你是個保守且謹慎的人,你喜歡細水長流的感情,也很珍惜身邊所有的朋友,特別懂得該如何維持一段長久的關係,所以吸引到的也會是一些很講信用且重感情的人。但其實你的心很軟,只要別人稍微對你好一點、說些好聽話,你就會開始默默同情他,所以要更小心謹慎身邊的人,提防他對你是不是別有居心喔～" , "射手座" : "您的下降星座是「射手座」,特質:外向活潑,很懂得如何看人你很會說話,很懂得如何與他人溝通,任何事情只要你一開口便能成功如你所願,這樣如此外向且能言善道的你,通常也是好人緣的代表,不管是什麼樣個性的人也都會被你這樣的性格所吸引,但其實對於好朋友這一塊,你也是特別有講求的,你會希望你身邊的好友能夠和你一樣志同道合,所以你也很明白要深交的對象是需要經過篩選的。" , "摩羯座" : "您的下降星座是「摩羯座」,特質:外在陽光且具親和力,內在是經常不安、多疑總是散發親和力的你,會給人一種很好親近的感覺,你對外人總是坦露出你很陽光的樣子,但殊不知那只是你偽裝起來的一面,真實的你是非常內斂且沒有安全感的,當有人做出對不起你的事情,你會再也無法信任他人,甚至開始產生自我懷疑,會認為是不是自己哪裡不夠好？導致變成這樣的局面。你的內心是渴望被好好保護的～所以也一直在尋找能和你心靈契合的人。"}}
// ----------------------------------------------------------------------------------------------------------------
function Contents() {  /*下拉式選單*/
    document.getElementById("myDropdown").classList.toggle("show");
    }
    window.onclick = function(event) {
    if (!event.target.matches('.dropbtn')) {
    document.getElementById("myDropdown").classList.remove("show");
    }
}
function Enter(){  /*進入輸入出生日期*/
    window.location.href = "html/判斷星座日期.html";
}
// ----------------------------------------------------------------------------------------------------------------
Fancybox.bind('[data-fancybox="gallery"]', {  /*12星座卡片語法*/
Toolbar: {
    display: {
        left: ["infobar"],
        middle: [
        "zoomIn",
        "zoomOut",
        "toggle1to1",
        "rotateCCW",
        "rotateCW",
        "flipX",
        "flipY",
        ],
        right: ["slideshow", "thumbs", "close"],
    },
},
});
// ----------------------------------------------------------------------------------------------------------------
function Constellation(){  /*12星座介紹*/
    var Constellation = document.querySelector('input[list="test"]').value;
    console.log(Constellation);
    if(Constellation == ""){
        alert("您沒有選擇12星座，請選擇");  /*彈跳視窗*/
        document.getElementById('test1').innerHTML = "您沒有選擇12星座<br>請選擇12星座&#128512;";
    }
    else{
        document.getElementById('test1').innerHTML = Traits["星座特質"][Constellation];
        // switch (Constellation){
        //     case "摩羯座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["摩羯座"];
        //         break;
        //     case "水瓶座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["水瓶座"];
        //         break;
        //     case "雙魚座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["雙魚座"];
        //         break;
        //     case "牡羊座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["牡羊座"];
        //         break;
        //     case "金牛座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["金牛座"];
        //         break;
        //     case "雙子座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["雙子座"];
        //         break;
        //     case "巨蟹座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["巨蟹座"];
        //         break;
        //     case "獅子座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["獅子座"];
        //         break;
        //     case "處女座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["處女座"];
        //         break;
        //     case "天秤座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["天秤座"];
        //         break;
        //     case "天蠍座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["天蠍座"];
        //         break;
        //     case "射手座":
        //         document.getElementById('test1').innerHTML = Traits["星座特質"]["射手座"];
        //         break;
        // }
    }
}
// ----------------------------------------------------------------------------------------------------------------
function Four_Elements(){  /*四象星座介紹*/
    var Elements = document.querySelector('input[list="test"]').value;
    console.log(Elements);
    if(Elements == ""){
        alert("您沒有選擇四象星座，請選擇");
        document.getElementById('test1').innerHTML = "您沒有選擇四象星座<br>請選擇四象星座&#128512;";
    }
    else{
        document.getElementById('test1').innerHTML = Traits["四象星座特質"][Elements];
        // switch (Elements){
        //     case "水象星座":
        //         document.getElementById('test1').innerHTML = Traits["四象星座特質"]["水象星座"];
        //         break;
        //     case "火象星座":
        //         document.getElementById('test1').innerHTML = Traits["四象星座特質"]["火象星座"];
        //         break;
        //     case "風象星座":
        //         document.getElementById('test1').innerHTML = Traits["四象星座特質"]["風象星座"];
        //         break;
        //     case "土象星座":
        //         document.getElementById('test1').innerHTML = Traits["四象星座特質"]["土象星座"];
        //         break;
        // }
    }
}
// ----------------------------------------------------------------------------------------------------------------
function Numerology(){  /*生命靈數介紹*/
    var Numerology = document.querySelector('input[list="test"]').value;
    console.log(Numerology);
    if(Numerology == ""){
        alert("您沒有選擇生命靈數，請選擇");
        document.getElementById('test1').innerHTML = "您沒有選擇生命靈數<br>請選擇生命靈數&#128512;";
    }
    else{
        document.getElementById('test1').innerHTML = Traits["生命靈數特質"][parseInt(Numerology)];
        // switch (Numerology){
        //     case "1":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][1];
        //         break;
        //     case "2":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][2];
        //         break;
        //     case "3":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][3];
        //         break;
        //     case "4":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][4];
        //         break;
        //     case "5":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][5];
        //         break;
        //     case "6":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][6];
        //         break;
        //     case "7":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][7];
        //         break;
        //     case "8":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][8];
        //         break;
        //     case "9":
        //         document.getElementById('test1').innerHTML = Traits["生命靈數特質"][9];
        //         break;
        // }
    }
}
// ----------------------------------------------------------------------------------------------------------------
function Ascendant(){  /*上升星座介紹*/
    var Ascendant = document.querySelector('input[list="test"]').value;
    console.log(Ascendant);
    if(Ascendant == ""){
        alert("您沒有選擇上升星座，請選擇");
        document.getElementById('test2').innerHTML = "您沒有選擇上升星座<br>請選擇上升星座&#128512;";
    }
    else{
        document.getElementById('test2').innerHTML = Traits["上升星座特質"][Ascendant];
        // switch (Ascendant){
        //     case "摩羯座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["摩羯座"];
        //         break;
        //     case "水瓶座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["水瓶座"];
        //         break;
        //     case "雙魚座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["雙魚座"];
        //         break;
        //     case "牡羊座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["牡羊座"];
        //         break;
        //     case "金牛座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["金牛座"];
        //         break;
        //     case "雙子座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["雙子座"];
        //         break;
        //     case "巨蟹座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["巨蟹座"];
        //         break;
        //     case "獅子座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["獅子座"];
        //         break;
        //     case "處女座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["處女座"];
        //         break;
        //     case "天秤座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["天秤座"];
        //         break;
        //     case "天蠍座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["天蠍座"];
        //         break;
        //     case "射手座":
        //         document.getElementById('test2').innerHTML = Traits["上升星座特質"]["射手座"];
        //         break;
        // }
    }
}
// ----------------------------------------------------------------------------------------------------------------
function Descendant(){  /*下降星座介紹*/
    var Descendant = document.querySelector('input[list="test"]').value;
    console.log(Descendant);
    if(Descendant == ""){
        alert("您沒有選擇下降星座，請選擇");
        document.getElementById('test1').innerHTML = "您沒有選擇下降星座<br>請選擇下降星座&#128512;";
    }
    else{
        document.getElementById('test1').innerHTML = Traits["下降星座特質"][Descendant];
        // switch (Descendant){
        //     case "摩羯座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["摩羯座"];
        //         break;
        //     case "水瓶座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["水瓶座"];
        //         break;
        //     case "雙魚座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["雙魚座"];
        //         break;
        //     case "牡羊座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["牡羊座"];
        //         break;
        //     case "金牛座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["金牛座"];
        //         break;
        //     case "雙子座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["雙子座"];
        //         break;
        //     case "巨蟹座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["巨蟹座"];
        //         break;
        //     case "獅子座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["獅子座"];
        //         break;
        //     case "處女座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["處女座"];
        //         break;
        //     case "天秤座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["天秤座"];
        //         break;
        //     case "天蠍座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["天蠍座"];
        //         break;
        //     case "射手座":
        //         document.getElementById('test1').innerHTML = Traits["下降星座特質"]["射手座"];
        //         break;
        // }
    }
}
// ----------------------------------------------------------------------------------------------------------------
function cal(){  /*BMI計算*/
    let height = document.getElementById("height").value;
    let weight = document.getElementById("weight").value;
    let bmi = (weight/(height*height)).toFixed(2);
    document.getElementById("BMI").innerHTML= bmi;
    if(bmi >= 27){
        document.getElementById("Introduce").innerHTML= "啊～「肥胖」，需要立刻力行「健康體重管理」囉！";
    }
    else if(bmi >= 24){
        document.getElementById("Introduce").innerHTML= "哦！「體重過重」了，要小心囉，趕快力行「健康體重管理」！";
    }
    else if(bmi >= 18.5){
        document.getElementById("Introduce").innerHTML= "恭喜！「健康體重」，要繼續保持！";
    }
    else{
        document.getElementById("Introduce").innerHTML= "「體重過輕」，需要多運動，均衡飲食，以增加體能，維持健康！";
    }
}
// ----------------------------------------------------------------------------------------------------------------